package by.it.LeraBichel.lesson02;

/* Нужно написать программу, которая вводит два числа с клавиатуры
и выводит их сумму на экран в виде

Ввод:
34 26

Вывод:
Sum = 26
*/
class TaskC1 {
    public static void main(String[] args){
        int a = 34;
        int b = 26;
        int c = a - b;
        System.out.println();
    }







}
